<!doctype html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />















  
  
  <link href="/thumb.github.io/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/thumb.github.io/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/thumb.github.io/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="android, algorithms" />








  <link rel="shortcut icon" type="image/x-icon" href="/thumb.github.io/favicon.ico?v=5.1.0" />






<meta property="og:type" content="website">
<meta property="og:title" content="TLLANO">
<meta property="og:url" content="https://le773.github.io/thumb.github.io/index.html">
<meta property="og:site_name" content="TLLANO">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="TLLANO">



<script type="text/javascript" id="hexo.configurations">

            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h6 id="查看内存布局命令"><a href="#查看内存布局命令" class="headerlink" title="查看内存布局命令"></a>查看内存布局命令</h6><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">c1 [filename].cpp /d1reportSingleClassLayout[className]</div></pre></td></tr></table></figure>
<h5 id="虚继承的类"><a href="#虚继承的类" class="headerlink" title="虚继承的类"></a>虚继承的类</h5><h6 id="虚继承的类的成员需要对齐"><a href="#虚继承的类的成员需要对齐" class="headerlink" title="虚继承的类的成员需要对齐"></a>虚继承的类的成员需要对齐</h6><p>source<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">class X &#123;</div><div class="line">    char x = &apos;a&apos;;</div><div class="line">&#125;;</div><div class="line">class Y : virtual public X &#123;</div><div class="line">    char y = &apos;y&apos;;</div><div class="line">&#125;;</div><div class="line">class Z : virtual public X &#123;</div><div class="line">    char z = &apos;z&apos;;</div><div class="line">&#125;;</div><div class="line">class W : public Z, public Y &#123;</div><div class="line">    char w = &apos;w&apos;;</div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<h6 id="debug"><a href="#debug" class="headerlink" title="debug"></a>debug</h6><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">cout &lt;&lt; sizeof(X) &lt;&lt; endl;</div><div class="line">cout &lt;&lt; sizeof(Y) &lt;&lt; endl;</div><div class="line">cout &lt;&lt; sizeof(Z) &lt;&lt; endl;</div><div class="line">cout &lt;&lt; sizeof(W) &lt;&lt; endl;</div></pre></td></tr></table></figure>
<p>result<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">1</div><div class="line">9</div><div class="line">9</div><div class="line">21</div></pre></td></tr></table></figure></p>
<h6 id="内存布局"><a href="#内存布局" class="headerlink" title="内存布局"></a>内存布局</h6><p>X内存布局<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">class X size(1):</div><div class="line">        +---</div><div class="line"> 0      | x</div><div class="line">        +---</div></pre></td></tr></table></figure></p>
<p>Y内存布局  4b 对齐<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div></pre></td><td class="code"><pre><div class="line">class Y size(9):</div><div class="line">        +---</div><div class="line"> 0      | &#123;vbptr&#125;</div><div class="line"> 4      | y</div><div class="line">        | &lt;alignment member&gt; (size=3)</div><div class="line">        +---</div><div class="line">        +--- (virtual base X)</div><div class="line"> 8      | x</div><div class="line">        +---</div><div class="line"></div><div class="line">Y::$vbtable@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 8 (Yd(Y+0)X)</div><div class="line">vbi:       class  offset o.vbptr  o.vbte fVtorDisp</div><div class="line">               X       8       0       4 0</div></pre></td></tr></table></figure></p>
<p>Z内存布局<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div></pre></td><td class="code"><pre><div class="line">class Z size(9):</div><div class="line">        +---</div><div class="line"> 0      | &#123;vbptr&#125;</div><div class="line"> 4      | z</div><div class="line">        | &lt;alignment member&gt; (size=3)</div><div class="line">        +---</div><div class="line">        +--- (virtual base X)</div><div class="line"> 8      | x</div><div class="line">        +---</div><div class="line"></div><div class="line">Z::$vbtable@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 8 (Zd(Z+0)X)</div><div class="line">vbi:       class  offset o.vbptr  o.vbte fVtorDisp</div><div class="line">               X       8       0       4 0</div></pre></td></tr></table></figure></p>
<p>W内存布局<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div></pre></td><td class="code"><pre><div class="line">class W size(21):</div><div class="line">        +---</div><div class="line"> 0      | +--- (base class Z)</div><div class="line"> 0      | | &#123;vbptr&#125;</div><div class="line"> 4      | | z</div><div class="line">        | | &lt;alignment member&gt; (size=3)</div><div class="line">        | +---</div><div class="line"> 8      | +--- (base class Y)</div><div class="line"> 8      | | &#123;vbptr&#125;</div><div class="line">12      | | y</div><div class="line">        | | &lt;alignment member&gt; (size=3)</div><div class="line">        | +---</div><div class="line">16      | w</div><div class="line">        | &lt;alignment member&gt; (size=3)</div><div class="line">        +---</div><div class="line">        +--- (virtual base X)</div><div class="line">20      | x</div><div class="line">        +---</div><div class="line"></div><div class="line">W::$vbtable@Z@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 20 (Wd(Z+0)X)</div><div class="line"></div><div class="line">W::$vbtable@Y@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 12 (Wd(Y+0)X)</div><div class="line">vbi:       class  offset o.vbptr  o.vbte fVtorDisp</div><div class="line">               X      20       0       4 0</div></pre></td></tr></table></figure></p>
<p>由于类Z、Y自身包含成员变量，子类需要3bit对齐，大小分别为9；</p>
<p>W 继承Z Y 的虚拟表地址 + Z Y 成员变量对齐 + 自身包含成员变量(需要对其) + 以及X的成员 = 21</p>
<h6 id="虚继承子类无成员"><a href="#虚继承子类无成员" class="headerlink" title="虚继承子类无成员"></a>虚继承子类无成员</h6><p>source<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">class X &#123;</div><div class="line">    char x = &apos;a&apos;;</div><div class="line">&#125;;</div><div class="line">class Y : virtual public X &#123;</div><div class="line">    /*char y = &apos;y&apos;;*/</div><div class="line">&#125;;</div><div class="line">class Z : virtual public X &#123;</div><div class="line">    /*char z = &apos;z&apos;;*/</div><div class="line">&#125;;</div><div class="line">class W : public Z, public Y &#123;</div><div class="line">    /*char w = &apos;w&apos;;*/</div><div class="line">&#125;;</div></pre></td></tr></table></figure></p>
<p>memory<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div></pre></td><td class="code"><pre><div class="line">class W size(9):</div><div class="line">        +---</div><div class="line"> 0      | +--- (base class Z)</div><div class="line"> 0      | | &#123;vbptr&#125;</div><div class="line">        | +---</div><div class="line"> 4      | +--- (base class Y)</div><div class="line"> 4      | | &#123;vbptr&#125;</div><div class="line">        | +---</div><div class="line">        +---</div><div class="line">        +--- (virtual base X)</div><div class="line"> 8      | x</div><div class="line">        +---</div><div class="line"></div><div class="line">W::$vbtable@Z@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 8 (Wd(Z+0)X)</div><div class="line"></div><div class="line">W::$vbtable@Y@:</div><div class="line"> 0      | 0</div><div class="line"> 1      | 4 (Wd(Y+0)X)</div><div class="line">vbi:       class  offset o.vbptr  o.vbte fVtorDisp</div><div class="line">               X       8       0       4 0</div></pre></td></tr></table></figure></p>
<p>由于类Z、Y无成员，子类不需要3bit对齐，W大小为9<br>继承Z Y 的虚拟表地址，以及X的成员；</p>
<h6 id="普通类继承"><a href="#普通类继承" class="headerlink" title="普通类继承"></a>普通类继承</h6><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">class X &#123;</div><div class="line">    char x = &apos;a&apos;;</div><div class="line">&#125;;</div><div class="line">class Y : /*virtual*/ public X &#123;</div><div class="line">    char y = &apos;y&apos;;</div><div class="line">&#125;;</div><div class="line">class Z : /*virtual*/ public X &#123;</div><div class="line">    char z = &apos;z&apos;;</div><div class="line">&#125;;</div><div class="line">class W : public Z, public Y &#123;</div><div class="line">    char w = &apos;w&apos;;</div><div class="line">&#125;;</div></pre></td></tr></table></figure>
<h6 id="result"><a href="#result" class="headerlink" title="result"></a>result</h6><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div></pre></td><td class="code"><pre><div class="line">class W size(5):</div><div class="line">        +---</div><div class="line"> 0      | +--- (base class Z)</div><div class="line"> 0      | | +--- (base class X)</div><div class="line"> 0      | | | x</div><div class="line">        | | +---</div><div class="line"> 1      | | z</div><div class="line">        | +---</div><div class="line"> 2      | +--- (base class Y)</div><div class="line"> 2      | | +--- (base class X)</div><div class="line"> 2      | | | x</div><div class="line">        | | +---</div><div class="line"> 3      | | y</div><div class="line">        | +---</div><div class="line"> 4      | w</div><div class="line">        +---</div></pre></td></tr></table></figure>
<h6 id="普通类内存布局"><a href="#普通类内存布局" class="headerlink" title="普通类内存布局"></a>普通类内存布局</h6><p>source</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div></pre></td><td class="code"><pre><div class="line">class Point &#123;</div><div class="line">public:</div><div class="line">    Point(float xval);</div><div class="line">    virtual ~Point(); // 虚表，自身类成员需要对齐</div><div class="line">    float x() const;</div><div class="line">    static int PointCount(); // 不存储在当前类内存</div><div class="line">private:</div><div class="line">    int t;</div><div class="line">    char a;</div><div class="line">    long l;</div><div class="line">&#125;;</div></pre></td></tr></table></figure>
<p>memory</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div></pre></td><td class="code"><pre><div class="line">class Point     size(16):</div><div class="line">        +---</div><div class="line"> 0      | &#123;vfptr&#125;</div><div class="line"> 4      | t</div><div class="line"> 8      | a</div><div class="line">        | &lt;alignment member&gt; (size=3)</div><div class="line">12      | l</div><div class="line">        +---</div><div class="line"></div><div class="line">Point::$vftable@:</div><div class="line">        | &amp;Point_meta</div><div class="line">        |  0</div><div class="line"> 0      | &amp;Point::&#123;dtor&#125;</div></pre></td></tr></table></figure>
          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-archives " itemscope itemtype="http://schema.org/Article">
